src/Catalogs/АвтоматическиеСкидки/АвтоматическиеСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АвтоматическиеСкидки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БонуснаяПрограмма</name>
    <type>
      <types>CatalogRef.БонусныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПредоставления</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОграниченияПоНоменклатуре</name>
    <type>
      <types>EnumRef.ВариантыОграниченийСкидокПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьГруппыВУточненииПоНоменклатуре</name>
    <comment>(Опт)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияПоПолучателямКонтрагентам</name>
    <comment>По контрагентам (опт) или складам (розница).</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияПоПолучателямСкладам</name>
    <comment>(Розница)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУсловияПоДК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоКатегориям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоНоменклатуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоЦеновымГруппам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияАвтоматическихСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПредоставления</name>
    <type>
      <types>EnumRef.ВариантыОбластейОграниченияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>Порядок округления</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПредоставления</name>
    <type>
      <types>EnumRef.СпособыПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПравилоНачисленияБонусов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияПоПолучателямСегментам</name>
    <comment>По контрагентам (опт) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоСегментамНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОграниченияПоПолучателям</name>
    <type>
      <types>EnumRef.ВариантыОграниченийСкидокПоКонтрагентам</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментВыдачиСообщения</name>
    <type>
      <types>EnumRef.ТочкиВыдачиСообщенияКассиру</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛюбойПодарокИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокИзКорзиныПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПодарокКакПродажу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КратноКоличествуУсловий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратПодарка</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУсловияПредъявленПромокод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаНаСледующуюПокупкуПоПромокоду</name>
    <type>
      <types>CatalogRef.АвтоматическиеСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУсловияАктивацииВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляРасчетаВРасширении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДаритьТолькоПолныйКомплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>(Общ) Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>(Общ) День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>(Общ) Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>(Общ) Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураГруппыЦеновыеГруппы</name>
    <attributes>
      <name>ЗначениеУточнения</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КатегорииНоменклатуры</types>
        <types>CatalogRef.ЦеновыеГруппы</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияПредоставления</name>
    <attributes>
      <name>УсловиеПредоставления</name>
      <type>
        <types>CatalogRef.УсловияПредоставленияСкидокНаценок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидкиКонтрагенты</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидкиСклады</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидкиСегменты</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.СегментыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборПодарков</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СпособыПредоставленияСкидокНаценок/СпособыПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПредоставленияСкидокНаценок</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
  <enumValues>
    <name>Округление</name>
  </enumValues>
  <enumValues>
    <name>КоличествоБонусныхБаллов</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтСуммыВВидеБонусныхБаллов</name>
  </enumValues>
  <enumValues>
    <name>ВидЦен</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>Подарок</name>
  </enumValues>
  <enumValues>
    <name>Промокод</name>
  </enumValues>
  <enumValues>
    <name>Расширение</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыОграниченийСкидокПоНоменклатуре/ВариантыОграниченийСкидокПоНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОграниченийСкидокПоНоменклатуре</name>
  <enumValues>
    <name>ПоНоменклатуре</name>
  </enumValues>
  <enumValues>
    <name>ПоКатегориям</name>
  </enumValues>
  <enumValues>
    <name>ПоЦеновымГруппам</name>
  </enumValues>
  <enumValues>
    <name>ПоСегменту</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/АвтоматическиеСкидки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("Действует");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Справочники.АвтоматическиеСкидки.Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Без копеек'");
	Элемент.Действует = Ложь;
	Элемент.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Округление;
	Элемент.Назначение = Перечисления.НазначенияАвтоматическихСкидок.Везде;
	Элемент.ОбластьПредоставления = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе;
	Элемент.ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
	Элемент.ВалютаПредоставления = Справочники.Валюты.ОсновнаяВалютаНачальногоЗаполнения();
	Элемент.ВариантОкругления = Перечисления.ВариантыОкругления.ПоАрифметическимПравилам;
	Элемент.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Функция - Шаблон процедуры расчета подключаемой скидки
//
// Параметры:
//  ИдентификаторСкидки - Строка - реквизит ИдентификаторДляРасчетаВРасширении справочника автоматических скидок
// 
// Возвращаемое значение:
//  Строка - многострочная строка для формы помощника добавления расширения
//
Функция ШаблонПроцедурыПодключаемойСкидки(ИдентификаторСкидки) Экспорт
	
	// АПК:1299-выкл проектное решение
	ШаблонПроцедуры = 
		НСтр("ru = '
		|// Выполняет произвольный алгоритм расчета скидок, и добавляет сработавшие скидки для каждой строки в таблицу ТаблицаСкидок.
		|// Результат расчета помещает в параметр ТаблицаСкидок.
		|// 
		|// Параметры:
		|//  СтрокаДерева		- см. СкидкиНаценкиСервер.ПолучитьДеревоСкидок - Строка дерева действующих скидок, с учетом групп совместного применения
		|//  ПараметрыРасчета	- см. СкидкиНаценкиСервер.ПодготовитьПараметрыРасчетаСкидок - Параметры текущего документа, необходимые для расчета скидок
		|//  ТаблицаСкидок		- см. СкидкиНаценкиСервер.ПолучитьПустуюТаблицуСкидокСРасшифровкой - Таблица скидок, которые следует применить к документу.
		|//  							Осуществляется возврат изменений параметра в вызывающую функцию.
		|Процедура ЗаполнитьТаблицуСкидок_%1(Знач СтрокаДерева, Знач ПараметрыРасчета, ТаблицаСкидок) Экспорт
		|		
		|	ПараметрыРасчетаСкидки = СкидкиНаценкиСервер.ПолучитьПараметрырасчетаПроизвольнойСкидки(СтрокаДерева, ПараметрыРасчета);
		|	// Таблица сообщений, которые будут показаны кассиру в момент расчета скидки, или пробития чека (только в розничном канале продаж)
		|	ТаблицаСообщений 	= СкидкиНаценкиСервер.ПустаяТаблицаСообщений();
		|	// Таблица подарков, которые следует предоставить покупателю. В данной таблице присутствуют только подарки, которые следует выдать на кассе.
		|	// Подарки, которые покупатель берет самостоятельно (например ""Три по цене двух"") предоставляются в виде скидок, добавлять их в таблицу не нужно.
		|	ТаблицаПодарков 	= СкидкиНаценкиСервер.ПустаяТаблицаПодарков();
		|	Для Каждого Товар Из ПараметрыРасчетаСкидки.Товары Цикл
		|		
		|		// Каждая примененная скидка добаляется в специальную таблицу, связанную с табличной частью товаров 
		|		НоваяСтрока           = ТаблицаСкидок.Добавить();
		|		НоваяСтрока.КлючСвязи = Товар.КлючСвязи;
		|		Если ПараметрыРасчетаСкидки.СтрокиСНевыполненнымиУсловиями.Найти(Товар.КлючСвязи) = Неопределено Тогда
		|			НоваяСтрока.Действует = Истина;
		|		Иначе
		|			// Скидка не применится, но она сохраняется в таблице для отображения в расшифровке расчета
		|			// Тогда можно будет увидеть, какие конкретно условия не выполнились
		|			НоваяСтрока.Действует = Ложь;
		|		КонецЕсли;
		|				
		|		Сумма = Товар.Сумма;
		|
		|#Область ПереопределяемыйАлгоритмРасчетаСуммыСкидки
		|
		|		ЗначениеСкидкиНаценки = ПараметрыРасчетаСкидки.ЗначениеСкидкиНаценки;
		|		СуммаСкидки = Окр((ЗначениеСкидкиНаценки / 100) * Сумма, 2);				
		|
		|#КонецОбласти		
		|
		|		НоваяСтрока.Сумма = СуммаСкидки;
		|		НоваяСтрока.ЗначениеСкидкиНаценки = ЗначениеСкидкиНаценки;
		|		НоваяСтрока.ТаблицаСообщений = ТаблицаСообщений;
		|		НоваяСтрока.ТаблицаПодарков = ТаблицаПодарков;
		|		// Информация для отображения в расшифровке расчета скидок
		|		Комментарий = ""Сумма "" + Сумма + "" * "" + ЗначениеСкидкиНаценки + ""%"";
		|		НоваяСтрока.Расшифровка = СкидкиНаценкиСервер.ПолучитьРасшифровкуСкидки(СтрокаДерева, НоваяСтрока.Сумма, ПараметрыРасчета, Комментарий, ЗначениеСкидкиНаценки);
		|		
		|	КонецЦикла;		
		|КонецПроцедуры
		|'");
	// АПК:1299-вкл
	
	АдаптированныйИдентификатор = СтрЗаменить(ИдентификаторСкидки, "-", "_");
	ШаблонПроцедуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПроцедуры, АдаптированныйИдентификатор);
	
	Возврат ШаблонПроцедуры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
